app/views/users/_user_grants_fields.html.erb

SELECT "grantholdings".* FROM "grantholdings" WHERE "grantholdings"."user_id" = ?  [["user_id", 1]]
---
<%= f.fields_for :grantholdings do |ff| %>
	<% user.grantholdings.each do |grantholding| %>