app/views/users/new.html.erb

			<div class="col-lg-10">
				<%= f.collection_select(:organization_id, Organization.all, :id, :name, { prompt: true }, { class: 'form-control'} ) %>
---
SELECT "organizations".* FROM "organizations"