app/views/users/show.html.erb

				<ul>
				<% @user.grantholdings.each do |g| %>
---
SELECT "grantholdings".* FROM "grantholdings" WHERE "grantholdings"."user_id" = ?  [["user_id", 1]]