app/controllers/grantholdings_controller.rb

SELECT "grants".* FROM "grants"
---
  def new
    @grants = Grant.all

SELECT  "grants".* FROM "grants" WHERE "grants"."id" = ? LIMIT 1  [["id", 1]]
SELECT "grants".* FROM "grants"
---
  def create
    selected_grants = Grant.where("id IN (?)", params[:grant_ids])
    if selected_grants.none?

SELECT "grantholdings".* FROM "grantholdings" WHERE "grantholdings"."user_id" = ?  [["user_id", 1]]
---
  def index
    @grantholdings = Grantholding.where(user_id: @user.id)

SELECT  "grantholdings".* FROM "grantholdings" WHERE "grantholdings"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @grantholding = Grantholding.find(params[:id])