app/controllers/organizations_controller.rb

  def create
    # if params[:commit] == "Cancel"
    #   redirect_to root_url and return
    # else
      @organization = Organization.new(organization_params)
      if @organization.save
        @admin = @organization.users.first
---
INSERT INTO "organizations" ("name", "description", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."organization_id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["organization_id", 14]]