app/controllers/timelogs_controller.rb

INSERT INTO "timelogs" ("comments", "start_time", "end_time", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    st = params[:timelog][:start_time]
    et = params[:timelog][:end_time]
    params[:timelog][:start_time] = convert_to_datetime(st)
    params[:timelog][:end_time]   = convert_to_datetime(et)
    if params[:timelog][:time_allocations_attributes]
      h = params[:timelog][:time_allocations_attributes][:hours]
      params[:timelog][:time_allocations_attributes][:hours] = convert_to_duration(h)
    end
    @timelog = Timelog.new(timelog_params)
    @timelog.user = current_user
    if !current_user?(@timelog.user) ||
       !current_user.admin? ||
       params[:commit] == "Cancel" # then
       redirect_to user_path(current_user) and return
    end
    if @timelog.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
    def find_timelogs_owner
      @user = User.find(params[:user_id])

SELECT "grantholdings".* FROM "grantholdings" WHERE "grantholdings"."user_id" = ?  [["user_id", 1]]
---
    def set_up_new_timelog_variables
      @user = current_user
      @timelog = Timelog.new
      @user.grantholdings.each do |gh|