app/controllers/users_controller.rb

SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT 1  [["id", 1]]
---
  def create
    if params[:commit] == "Cancel"
      redirect_to root_url and return
    else
      @user = User.new(user_params)
      organization = Organization.find_by(id: params[:user][:organization_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def grants_fulfillments_table
    @user = User.find(session[:user_id])

UPDATE "users" SET "first_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "Daniel"], ["updated_at", "2015-09-05 20:26:11.637655"], ["id", 1]]
---
  def update
    if params[:commit] == "Cancel"
      redirect_to user_path(current_user) and return

    else
      if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
    def find_user_by_id
      @user = User.find_by(id: params[:id])